backend/models/Kembali.php

SELECT COUNT(*) FROM `t_d_buku` WHERE `id_buku`='16.5434.009402'
SELECT COUNT(*) FROM `t_d_kaset` WHERE `id_kaset`='16.5434.009402'
SELECT * FROM `t_d_buku` WHERE `id_buku`='16.5434.009402'
---
    public function Peminjaman() {

            $pesan_pinjam = Peminjaman::find()->where(['id_d_buku'=>$this->id_bahan_pustaka])->count();
            $pesan_pinjakaset = Peminjaman::find()->where(['id_d_kaset'=>$this->id_bahan_pustaka])->count();

            $buku = models\DetailBuku::find()->where(['id_buku' => $this->id_bahan_pustaka])->count();
            $kaset = models\DetailKaset::find()->where(['id_kaset' => $this->id_bahan_pustaka])->count();

            if ($pesan_pinjam == 0 && $pesan_pinjakaset == 0) {
                Yii::$app->session->setFlash('danger', 'buku/kaset  tidak ditemukan');
            } else {
                $peminjaman;
                if ($pesan_pinjam > 0) {
                    $peminjaman = Peminjaman::findOne(['id_d_buku'=>$this->id_bahan_pustaka,'acc2'=>NULL]);
                    $buku = models\DetailBuku::findOne(['id_buku' => $this->id_bahan_pustaka]);